vvpai9/Keil/Keil_v5/ARM/Pack/.Web/TexasInstruments.MSPM0G511X_G518X_DFP.pdsc
                        __ap = 4;
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                        WriteAP(0x00, 0x100008);
                        DAP_Delay(5000);
                    </block>
                    <block>
                        __var nReset = 0x80;
                        __var canReadPins = 0;
                        __var BOOTDIAG_READ = 0;
                        __var AHB_STATUS = 0;
                        __ap = 1;
                        BOOTDIAG_READ = ReadAP(0x10);
                        __ap = 0;
                        AHB_STATUS = ReadAP(0xFC);
                        __ap = 4;
                    </block>
                    <control if = "(BOOTDIAG_READ == 0x07)">
                        <!-- If the AHB IDR can be read then we do nothing, otherwise there is an issue-->
                        <control if = "!AHB_STATUS">
                            <block>
                                Query(0, "Cannot view the AHB-AP, debug access has been disabled or nested exception occured. Please reset the device.",1);
                            </block>
                        </control>
                    </control>
                    <control if = "(BOOTDIAG_READ == 0x36)">
                        <!-- NONMAIN has been corrupted due to a possiblity of several reason but device cannot be accessed-->
                        <block>
                            Query(0, "NONMAIN has been corrupted, this can be caused by erasing without programming, invalid BCR/BSL CRC value, or incorrectly modifying NONMAIN",1);
                        </block>
                    </control>
                    <control if = "(BOOTDIAG_READ == 0x0004110A)">
                        <block>
                            // De-assert nRESET line to activate the hardware reset
                            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
                        </block>
                        <!-- Keep reset active for 50 ms -->
                        <control while="1" timeout="200"/>
                        <control if="canReadPins">
                            <!-- Assert nRESET line and wait max. 1s for recovery -->
                            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
                        </control>
                        <control if="!canReadPins">
                            <block>
                            // Assert nRESET line
                            DAP_SWJ_Pins(nReset, nReset, 0);
                            </block>
                            <!-- Wait 100ms for recovery if nRESET not readable -->
                            <control while="1" timeout="100000"/>
                        </control>
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) == 0">
                        <block>
                            WriteAP(0x00, 0x190008);
                            WriteAP(0xF0, 0x01);
                        </block> 
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) != 0">
                        <block>
                            WriteAP(0xF0, 0x01);
                            WriteAP(0x00, 0xF90008);
                            WriteAP(0xF0, 0x01);
                        </block>
                    </control>
                    <block>
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                        __ap = 0; //lets make sure we reset the access point selection
                    </block>
                </sequence>
                <sequence name="DebugDeviceUnlock">
                    <block>
                        __ap = 1;
                        __var deviceID = 0;
                        __var version = 0;
                        __var partNum = 0;
                        __var manuf = 0;
                        __var isMSPM0G511X_G518X = 0;
                        __var isProduction = 0;
                        __var continueId = 0;
                        deviceID =   ReadAP(0x00);
                        version = deviceID >> 28;
                        partNum = (deviceID &amp; 0x0FFFF000) >> 12;
                        manuf = (deviceID &amp; 0x00000FFE) >> 1;
                        isMSPM0G511X_G518X = (partNum == 0xBBBC) &amp;&amp; (manuf == 0x17);
                        isProduction = (version &gt; 0);
                    </block>
                    <!-- Check if device ID is correct -->
                    <control if="!isMSPM0G511X_G518X">
                        <block>
                            continueId = Query(1, "Incorrect ID. This support package is for MSPM0G511X_G518X devices. Continue?", 4);
                        </block>
                    </control>
                    <control if="continueId == 4">
                        <block>
                            Message(2, "Invalid ID");
                        </block>
                    </control>
                </sequence>
                <sequence name="ResetSystem">
                    <block>
                        // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
                        __ap = 4;
                        WriteAP(0xF0, 0x01);
                        DAP_Delay(20000); 
                    </block>
                    <block>
                        // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
                        __var SCS_Addr   = 0xE000E000;
                        __var AIRCR_Addr = SCS_Addr + 0xD0C;
                        __var DHCSR_Addr = SCS_Addr + 0xDF0;
                
                        // Execute SYSRESETREQ via AIRCR
                        Write32(AIRCR_Addr, 0x05FA0004);
                    </block>
                    <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
                    <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
                </sequence>
            </sequences>
            <!-- features common for the whole family -->
            <feature type="NVIC" n="32" name="Nested Vectored Interrupt Controller (NVIC)"/>
            <feature type="DMA" n="12" name="Direct Memory Access (DMA)"/>
            <feature type="MemoryOther" name="Up to 128KB Flash memory with built-in error correction code (ECC)"/>
            <feature type="MemoryOther" name="Up to 32KB SRAM with hardware parity"/>
            <feature type="XTAL" n="4000000" m="48000000" name="High Frequency crystal (HFXT)"/>
            <feature type="PLL" n="1" name="Internal PLL"/>
            <feature type="RTC" n="32768" name="Internal RTC with alarm and calendar modes"/>
            <feature type="ClockOther" name="Internal 4-32MHz oscillator with +-1% accuracy (SYSOSC)"/>
            <feature type="ClockOther" name="Internal 32kHz oscillator (LFOSC)"/>
            <feature type="ClockOther" name="Low Frequency 32kHz crystal (LFXT)"/>
            <feature type="PowerMode" n="12" name="RUN0, RUN1, RUN2, SLEEP0, SLEEP1, SLEEP2, STOP0, STOP1, STOP2, STANDBY0, STANDBY1, SHUTDOWN"/>
            <feature type="VCC" n="1.62" m="3.6"/>
            <feature type="Temp" n="-40" m="125" name="Extended Operating Temperature Range"/>
            <feature type="AnalogOther" n="1" name="High-speed comparator (COMP) with 8-bit reference DACs"/>
            <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
            <feature type="Timer" n="14" m="16" name="Four 16-bit advanced timers with deadband supporting up to 14 PWM channels"/>
            <feature type="TimerOther" n="2" name="16-bit general purpose timer"/>
            <feature type="TimerOther" n="1" name="16-bit general purpose timer supporting low power operation in STANDBY mode"/>
            <feature type="TimerOther" n="1" name="16-bit advanced timers with deadband support up to 12 PWM channels"/>
            <feature type="TimerOther" n="1" name="One basic software timer including 4 independent configuration 16-bit counters"/>
            <feature type="WDT" n="3" name="Two Window-watchdog timer (WWDT), one independent watchdog timer (IWDT)"/>
            <feature type="MPSerial" n="4" name="Four configurable serial interfaces supporting up to three UART modules, up to two I2C modules, and up to two SPI modules."/>
            <feature type="I2S" n="1" name="One digital audio interface supporting several standardized serial interfaces to audio device"/>
            <feature type="Crypto" n="128.256" name="HW accelerated AES Encryption/Decryption Engine"/>
            <feature type="ADC" n="26" m="12" name="One simultaneous 4MSPS analog-to-digital converters (ADC)"/>
            <feature type="IOs" n="59" name="General purpose I/Os, including two 5-V tolerant, three high-drive with 20mA drive strength, and two high-speed "/>
            <feature type="USBD" n="1" name="One USB2.0 interface supporting full-speed (12-Mbps) compliant device and host mode functionality"/>
<!-- ************************  Subfamily MSPM0G511X  **************************** -->
            <subFamily DsubFamily="MSPM0G511X">
                <!-- *************************  Device MSPM0G5117  ***************************** -->
                <device Dname="MSPM0G5117">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00020000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00020000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00008000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00008000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00008000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00008000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000800" default="1"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000200" default="1"/>
                    <memory     name="Data" access="r"  start="0x41D00000" size="0x00004000" default="1"/>
                    <compile    define="__MSPM0G5117__"/>
                    <debug      svd="03_SVD/MSPM0G511X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0G511X_G518X_MAIN_128KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20200000" RAMsize="0x00008000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0G511X_G518X_NONMAIN.FLM" start="0x41C00000" size="0x00000800" RAMstart="0x20200000" RAMsize="0x00008000" default="0"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0G511X_G518X_DATA_8KB.FLM" start="0x41D00000" size="0x00004000" RAMstart="0x20200000" RAMsize="0x00008000" default="0"/>
                </device>
